import React from "react";
import { Box, Footnote, Heading, Paragraph, Title } from "~/components/atoms";
import { theme } from "~/theme";

export const RecruitDetail: React.FC = () => {
  return (
    <>
      <Box>
        <Footnote text="キャスト" marginTop="0" />
        <Title text="Cast" />
      </Box>

      <Box marginTop={theme.space.m}>
        <Heading text="勤務時間" />
        <Box marginLeft={theme.space.s}>
          <Paragraph text="20:00 〜 翌日1:00" />
        </Box>
      </Box>
    </>
  );
};

/**
 *キャスト
○勤務時間20:00〜翌1:00
○給与
時給10,000円〜
○休日
日・GW・夏休暇・年末年始休暇
○待遇
-全額日払い
-体入時給10,000円以上
-各種高額バック有り
-週1/2h〜OK
-短期OK
-ヘアメ完備
-鍵付きの個人ロッカー完備
-前店の給与を考慮
-送迎有り(都外可)



正社員

○勤務時間17:00〜翌2:00
○給与
- 店長・店長候補(社員) 月給 700,000円〜 
- ホール(社員) 月給 320,000円〜                    
- キャッシャー(社員) 月給 400,000円〜                        
- エスコート(社員) 月給 400,000円〜                        
- キッチン(社員) 月給 400,000円〜
○休日
日祝、GW、夏休暇、年末年始休暇
○待遇
-寮完備
-昇給昇格随時あり
-社員旅行あり
-独立支援制度あり
-研修制度あり
-制服貸与
-体験入社OK
-正社員登用社保完備
-年齢不問
-経験者優遇
-未経験者歓迎





ホールスタッフ(アルバイト)

○勤務時間19:30〜翌2:00
○給与
- ホール時給2,000円〜
(研修時給1800円)
- エスコート(アルバイト) 時給 4,000円〜
○休日
日祝、GW、夏休暇、年末年始休暇
○待遇
-送迎有り
-昇給昇格随時あり
-独立支援制度あり
-研修制度あり
-制服貸与
-体験入社OK
-正社員登用社保完備
-年齢不問
-経験者優遇
-未経験者歓迎


 */
